NordicPlayground/nrf528xx-ble-throughput-demo/ble_app_att_mtu_throughput/main.c
static void dummy_preferred_phy_select()
{
	button_read();
	
	if(m_button == BUTTON_1)
	{
		m_test_params.rxtx_phy = BLE_GAP_PHY_2MBPS;
		preferred_phy_set(m_test_params.rxtx_phy);
		NRF_LOG_INFO("Preferred PHY set to 2Mbps\n\r");
		bsp_board_led_off(BSP_BOARD_LED_3);
	}
	else if(m_button == BUTTON_2)
	{
		m_test_params.rxtx_phy = BLE_GAP_PHY_CODED;
		preferred_phy_set(m_test_params.rxtx_phy);
		NRF_LOG_INFO("Preferred PHY set to coded\n\r");
		bsp_board_led_on(BSP_BOARD_LED_3);
	}
	
}

int main(void)
{
    log_init();
	
	bool display_connected = false;
	//comment out display_init if no display is attached
	display_connected = display_init();
	
    leds_init();
    timer_init();
    counter_init();
	if(display_connected)
	{
		#ifdef NRF52840_XXAA
			buttons_init(buttons);
		#endif
		#ifdef NRF52832
			buttons_init(buttons_display_pca10040);
		#endif
	}
	else
	{
		buttons_init(buttons);
	}

    ble_stack_init();

	
    gap_params_init();
    conn_params_init();
    gatt_init();
    advertising_data_set();

	sd_ble_gap_tx_power_set(4);
	
    server_init();
    client_init();

    gatt_mtu_set(m_test_params.att_mtu);
    data_len_ext_set(m_test_params.data_len_ext_enabled);
    conn_evt_len_ext_set(m_test_params.conn_evt_len_ext_enabled);
    preferred_phy_set(m_test_params.rxtx_phy);
	
    NRF_LOG_INFO("ATT MTU example started.\r\n");
    NRF_LOG_INFO("Press button 1 on the board connected to the PC.\r\n");
    NRF_LOG_INFO("Press button 2 on other board.\r\n");
    NRF_LOG_FLUSH();
	
	display_clear();
	//display_print_line_inc("ATT MTU example started.\r\n");
    display_print_line_inc("- Press button 1 on this board");
    display_print_line_inc("- Press button 2 on other board.");
	display_show();

    uint8_t button = button_read();

	if(button == BUTTON_1)
	{
		m_board_role = BOARD_TESTER;
	}
	else
	{
		m_board_role = BOARD_DUMMY;
	}

    if (m_board_role == BOARD_TESTER)
    {
        m_print_menu = true;
    }
    if (m_board_role == BOARD_DUMMY)
    {
        advertising_start();
        scan_start();
    }

    // Enter main loop.
    NRF_LOG_INFO("Entering main loop.\r\n");
    for (;;)
    {
		if (m_board_role == BOARD_DUMMY)
		{
			dummy_preferred_phy_select();
		}
		if(m_transfer_done)
		{
			display_print_line_inc("");
			display_print_line_inc("Press any button to exit.");
			display_show();
			
			button_read();
			m_transfer_done = false;
		}
		
        if (m_print_menu && !m_transfer_done)
        {
            menu_print();
        }

        if (is_test_ready())
        {
			//clear data from the last transfer
			m_display_show_transfer_data = false;
			m_transfer_data.bytes_transfered = 0;
			
            m_run_test = true;
            test_run();
        }

		if(m_display_show_transfer_data)
		{
			display_draw_test_run_screen(&m_transfer_data);
			m_display_show_transfer_data = false;
		}
		
		if(m_display_show)
		{
			display_show();
			m_display_show = false;
		}
		
        if (!NRF_LOG_PROCESS())
        {
            wait_for_event();
        }

    }
}


/**
 * @}
 */
